; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	infrared1 - mode
	infrared3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation4 - direction
	Star3 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite2 GroundStation4)
	(have_image Planet5 thermograph2)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon7 thermograph2)
	(have_image Planet8 thermograph2)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared3)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 thermograph2)
	(have_image Planet13 infrared3)
	(have_image Star14 thermograph2)
	(have_image Phenomenon15 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 0 of 13
5. (take_image satellite1 planet10 instrument3 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon9 instrument3 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 13
9. (turn_to satellite0 groundstation4 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 13
10. (take_image satellite1 phenomenon11 instrument3 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 3 of 13
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 13
12. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 3 of 13
13. (turn_to satellite0 phenomenon15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 13
14. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 4 of 13
15. (turn_to satellite0 phenomenon6 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 13
16. (take_image satellite0 phenomenon6 instrument0 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 5 of 13
17. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 13
18. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 6 of 13
19. (turn_to satellite0 planet12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet12)
   goals met: 6 of 13
20. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 7 of 13
21. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 7 of 13
22. (take_image satellite0 planet13 instrument0 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 8 of 13
23. (turn_to satellite0 planet5 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet5)
   goals met: 8 of 13
24. (take_image satellite0 planet5 instrument0 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 9 of 13
25. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 9 of 13
26. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 10 of 13
27. (turn_to satellite0 star14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star14)
   goals met: 10 of 13
28. (take_image satellite0 star14 instrument0 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 11 of 13
29. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 12 of 13
30. (turn_to satellite2 groundstation4 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation4)
   goals met: 13 of 13
